<?php

// + - * / % **  --- ตัวดำเนินการทางคณิตศาสตร์

//  +=  -=  *=  /=  ----- ตัวเพิ่มค่าทางคณิตศาสตร์

// increment decrement  operator   ++(+1)   -- (-1)

// $x = 120;

// $y = 35;

// $x = $x - 1;  //   --
// $x = $x + 1;  // ++
// $x++;

// echo $x; // 119

// echo $z . '<br>' . ( $x * $y );

// Comparition operator  เปรียบเทียบ
//    ==  , === ,   เท่ากันไหม
// != , <>  , !== ,  ไม่เท่ากันไหม
// > , < , <= , >=, <=>

// Logical Operator
// and &&   เป็นจริงทั้งคู่
//  or ||  เงื่อนไขอย่างน้อย 1 ต้องเป็นจริง

// , !

// $a = 10;

// $b = 1100;

// $c = 501;
// //                    true                            true
// if (  ( $a == 10 || $b == 100 ) && $c != 500 )
// {
//     echo 'ถูกต้อง';
// }
// else
// {
//     echo 'ไม่ถูกต้อง';
// }

$a = 500;
///      true     >   !   ==   false
if ( !$a == 500 )
{
    echo 'เท่ากับ 500';
}
else
{
    echo 'ไม่เท่ากับ 500';
}

// $x = 5;
// $y = 5;

// var_dump( $x <=> $y );

// if (  )
// {
//     echo 'มีค่าเท่ากัน';
// }
// else
// {
//     echo 'มีค่าไม่เท่ากัน';
// }

// $x = 250;
// $y = 54;

// $txt1 = 'ความรู้';
// $txt2 = 'อ่านไม่ออก';

// $num1 = 100000; // integer
// $num2 = '100000'; // string

// if ( $num1 === $num2 )
// {
//     echo 'มีค่าเท่ากัน';
// }
// else
// {
//     echo 'มีค่าไม่เท่ากัน';
// }

// if ( $txt1 != $txt2 )
// {
//     echo 'คำเหมือนกัน';
// }
// else
// {
//     echo 'คำไม่เหมือนกัน';
// }

// if ( $x < $y ) // เงื่อนไข เป็นจริง
// {
//     echo 'x น้อยกว่า y';
// }

// $age = 16;

// if ( $age >= 17 )
// {
//     echo 'ดูเนื้อหาได้ตามปกติ';
// }
// else
// {
//     echo 'คุณอายุไม่ถึง 18 ปี ไม่สามารถดูเนื้อหาได้';
// }

// $age = 'test';

// switch ( $age )
// {

// case "test":
//     echo 'Yes TEst';
//     break;

// case 15:
//     echo 'Yes 15';
//     break;

// case 16:
//     echo 'Yes 16';
//     break;

// case 17:
//     echo 'Yes 17';
//     break;

// case 18:
//     echo 'Yes 18';
//     break;

// case 19:
//     echo 'Yes 19';
//     break;

// case 20:
//     echo 'Yes 20';
//     break;

// default:
//     echo 'No';
//     break;
// }

?>